%% Machine Learning Homework#3 Demo- 2023/10/16

%% Quadratic problem
% ==============================================================
% 1. 請參照quadprog的Documentation，將訓練資料矩陣化並調整成符合quadprog的輸入格式。
% 2. 由於dual problem的求解演算法不同和精度差異，Matlab和Python的Alpha值會有差異
% ==============================================================
% alpha = quadprog(H,f,A,b,Aeq,beq,lb,ub);


% ==========================================
% 請以下列方法對alpha值進行處理，再接著求解bias
% ==========================================
% alphaOri = alpha;
% alpha(alpha<   sqrt(eps) ) = 0;
% alpha(alpha>(C-sqrt(eps))) = C;
% alpha = round(alpha,6)

%% Support Vector Machine
%=========================================================================%
%   接續二次規劃所求得之alpha計算bias，即可得到SVM之模型。
%   此階段程式碼請自行實現。
%=========================================================================%

%% Test 
%=========================================================================%
%   利用上述步驟所訓練之SVM之模型建立決策函數，並將test代入得到決策結果。
%   此階段程式碼請自行實現。
%=========================================================================%








